Revit 2024 API
ComponentRepeater.IsTypeValidForRepeater Method
 Determines whether given family type can be used as the default type for the repeater.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public bool IsTypeValidForRepeater(
	ElementId typeId
)
Visual Basic
Public Function IsTypeValidForRepeater ( _
	typeId As ElementId _
) As Boolean
Visual C++
public:
bool IsTypeValidForRepeater(
	ElementId^ typeId
)
Parameters
typeId
Type: Autodesk.Revit.DB.ElementId
 The element id of the type.
Return Value
 True if the family type can be used as the default type for the repeater.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ComponentRepeater Class
Autodesk.Revit.DB Namespace